; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v5)
		(pred_2 ?v3)
		(pred_5 ?v2)
		(pred_1 ?v2)
		(pred_3 ?v3 ?v2)
		(pred_6)
		(pred_4 ?v3))

   (:action op_3
       :parameters  (?v8 ?v7)
       :precondition (and (not-eq ?v8 ?v7) 
                          (pred_5 ?v8) (pred_5 ?v7) (pred_1 ?v8))
       :effect (and  (pred_1 ?v7)
		     (not (pred_1 ?v8))))


   (:action op_1
       :parameters (?v4 ?v1)
       :precondition  (and  (pred_2 ?v4) (pred_5 ?v1)
			    (pred_3 ?v4 ?v1) (pred_1 ?v1) (pred_6))
       :effect (and (pred_4 ?v4)
		    (not (pred_3 ?v4 ?v1)) 
		    (not (pred_6))))

   (:action op_2
       :parameters  (?v4  ?v1)
       :precondition  (and  (pred_2 ?v4) (pred_5 ?v1)
			    (pred_4 ?v4) (pred_1 ?v1))
       :effect (and (pred_3 ?v4 ?v1)
		    (pred_6)
		    (not (pred_4 ?v4)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_06 obj_02 obj_03 
          obj_01 obj_05 obj_04 
)
(:init
(pred_5 obj_06)
(pred_5 obj_02)
(pred_5 obj_03)
(pred_2 obj_01)
(pred_2 obj_05)
(pred_2 obj_04)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(pred_6)
(pred_3 obj_01 obj_02)
(pred_3 obj_05 obj_06)
(pred_3 obj_04 obj_02)
(pred_1 obj_06)
)
(:goal
(and
(pred_3 obj_01 obj_02)
(pred_3 obj_05 obj_03)
(pred_3 obj_04 obj_02)
)
)

(:constraints
  (sometime-before  (pred_3 obj_05 obj_03) (pred_1 obj_02))
)
)

; plan
1. (op_1 obj_05 obj_06)
   deleted: (pred_3 obj_05 obj_06) (pred_6)
   added: (pred_4 obj_05)
   goals met: 2 of 3
2. (op_3 obj_06 obj_02)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_02)
   goals met: 2 of 3
3. (op_2 obj_05 obj_02)
   deleted: (pred_4 obj_05)
   added: (pred_3 obj_05 obj_02) (pred_6)
   goals met: 2 of 3
4. (op_1 obj_01 obj_02)
   deleted: (pred_3 obj_01 obj_02) (pred_6)
   added: (pred_4 obj_01)
   goals met: 1 of 3
5. (op_3 obj_02 obj_03)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_03)
   goals met: 1 of 3
6. (op_2 obj_01 obj_03)
   deleted: (pred_4 obj_01)
   added: (pred_3 obj_01 obj_03) (pred_6)
   goals met: 1 of 3
7. (op_3 obj_03 obj_02)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_02)
   goals met: 1 of 3
8. (op_1 obj_05 obj_02)
   deleted: (pred_3 obj_05 obj_02) (pred_6)
   added: (pred_4 obj_05)
   goals met: 1 of 3
9. (op_3 obj_02 obj_03)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_03)
   goals met: 1 of 3
10. (op_2 obj_05 obj_03)
   deleted: (pred_4 obj_05)
   added: (pred_3 obj_05 obj_03) (pred_6)
   goals met: 2 of 3
11. (op_1 obj_01 obj_03)
   deleted: (pred_3 obj_01 obj_03) (pred_6)
   added: (pred_4 obj_01)
   goals met: 2 of 3
12. (op_3 obj_03 obj_02)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_02)
   goals met: 2 of 3
13. (op_2 obj_01 obj_02)
   deleted: (pred_4 obj_01)
   added: (pred_3 obj_01 obj_02) (pred_6)
   goals met: 3 of 3
